GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k42.h
extern volatile OSCFRQbits_t OSCFRQbits __at(0x39DF);
// bitfield macros
#define _OSCFRQ_FRQ_POSN                                    0x0
#define _OSCFRQ_FRQ_POSITION                                0x0
#define _OSCFRQ_FRQ_SIZE                                    0x4
#define _OSCFRQ_FRQ_LENGTH                                  0x4
#define _OSCFRQ_FRQ_MASK                                    0xF
#define _OSCFRQ_FRQ0_POSN                                   0x0
#define _OSCFRQ_FRQ0_POSITION                               0x0
#define _OSCFRQ_FRQ0_SIZE                                   0x1
#define _OSCFRQ_FRQ0_LENGTH                                 0x1
#define _OSCFRQ_FRQ0_MASK                                   0x1
#define _OSCFRQ_FRQ1_POSN                                   0x1
#define _OSCFRQ_FRQ1_POSITION                               0x1
#define _OSCFRQ_FRQ1_SIZE                                   0x1
#define _OSCFRQ_FRQ1_LENGTH                                 0x1
#define _OSCFRQ_FRQ1_MASK                                   0x2
#define _OSCFRQ_FRQ2_POSN                                   0x2
#define _OSCFRQ_FRQ2_POSITION                               0x2
#define _OSCFRQ_FRQ2_SIZE                                   0x1
#define _OSCFRQ_FRQ2_LENGTH                                 0x1
#define _OSCFRQ_FRQ2_MASK                                   0x4
#define _OSCFRQ_FRQ3_POSN                                   0x3
#define _OSCFRQ_FRQ3_POSITION                               0x3
#define _OSCFRQ_FRQ3_SIZE                                   0x1
#define _OSCFRQ_FRQ3_LENGTH                                 0x1
#define _OSCFRQ_FRQ3_MASK                                   0x8
#define _OSCFRQ_HFFRQ_POSN                                  0x0
#define _OSCFRQ_HFFRQ_POSITION                              0x0
#define _OSCFRQ_HFFRQ_SIZE                                  0x4
#define _OSCFRQ_HFFRQ_LENGTH                                0x4
#define _OSCFRQ_HFFRQ_MASK                                  0xF
#define _OSCFRQ_HFFRQ0_POSN                                 0x0
#define _OSCFRQ_HFFRQ0_POSITION                             0x0
#define _OSCFRQ_HFFRQ0_SIZE                                 0x1
#define _OSCFRQ_HFFRQ0_LENGTH                               0x1
#define _OSCFRQ_HFFRQ0_MASK                                 0x1
#define _OSCFRQ_HFFRQ1_POSN                                 0x1
#define _OSCFRQ_HFFRQ1_POSITION                             0x1
#define _OSCFRQ_HFFRQ1_SIZE                                 0x1
#define _OSCFRQ_HFFRQ1_LENGTH                               0x1
#define _OSCFRQ_HFFRQ1_MASK                                 0x2
#define _OSCFRQ_HFFRQ2_POSN                                 0x2
#define _OSCFRQ_HFFRQ2_POSITION                             0x2
#define _OSCFRQ_HFFRQ2_SIZE                                 0x1
#define _OSCFRQ_HFFRQ2_LENGTH                               0x1
#define _OSCFRQ_HFFRQ2_MASK                                 0x4
#define _OSCFRQ_HFFRQ3_POSN                                 0x3
#define _OSCFRQ_HFFRQ3_POSITION                             0x3
#define _OSCFRQ_HFFRQ3_SIZE                                 0x1
#define _OSCFRQ_HFFRQ3_LENGTH                               0x1
#define _OSCFRQ_HFFRQ3_MASK                                 0x8

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x39E0);
#ifndef _LIB_BUILD
asm("NVMADRL equ 039E0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :8;
    };
    struct {
        unsigned ADR0                   :1;
        unsigned ADR1                   :1;
        unsigned ADR2                   :1;
        unsigned ADR3                   :1;
        unsigned ADR4                   :1;
        unsigned ADR5                   :1;
        unsigned ADR6                   :1;
        unsigned ADR7                   :1;
    };
    struct {
        unsigned NVMADR                 :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x39E0);
// bitfield macros
#define _NVMADRL_ADR_POSN                                   0x0
#define _NVMADRL_ADR_POSITION                               0x0
#define _NVMADRL_ADR_SIZE                                   0x8
#define _NVMADRL_ADR_LENGTH                                 0x8
#define _NVMADRL_ADR_MASK                                   0xFF
#define _NVMADRL_ADR0_POSN                                  0x0
#define _NVMADRL_ADR0_POSITION                              0x0
#define _NVMADRL_ADR0_SIZE                                  0x1
#define _NVMADRL_ADR0_LENGTH                                0x1
#define _NVMADRL_ADR0_MASK                                  0x1
#define _NVMADRL_ADR1_POSN                                  0x1
#define _NVMADRL_ADR1_POSITION                              0x1
#define _NVMADRL_ADR1_SIZE                                  0x1
#define _NVMADRL_ADR1_LENGTH                                0x1
#define _NVMADRL_ADR1_MASK                                  0x2
#define _NVMADRL_ADR2_POSN                                  0x2
#define _NVMADRL_ADR2_POSITION                              0x2
#define _NVMADRL_ADR2_SIZE                                  0x1
#define _NVMADRL_ADR2_LENGTH                                0x1
#define _NVMADRL_ADR2_MASK                                  0x4
#define _NVMADRL_ADR3_POSN                                  0x3
#define _NVMADRL_ADR3_POSITION                              0x3
#define _NVMADRL_ADR3_SIZE                                  0x1
#define _NVMADRL_ADR3_LENGTH                                0x1
#define _NVMADRL_ADR3_MASK                                  0x8
#define _NVMADRL_ADR4_POSN                                  0x4
#define _NVMADRL_ADR4_POSITION                              0x4
#define _NVMADRL_ADR4_SIZE                                  0x1
#define _NVMADRL_ADR4_LENGTH                                0x1
#define _NVMADRL_ADR4_MASK                                  0x10
#define _NVMADRL_ADR5_POSN                                  0x5
#define _NVMADRL_ADR5_POSITION                              0x5
#define _NVMADRL_ADR5_SIZE                                  0x1
#define _NVMADRL_ADR5_LENGTH                                0x1
#define _NVMADRL_ADR5_MASK                                  0x20
#define _NVMADRL_ADR6_POSN                                  0x6
#define _NVMADRL_ADR6_POSITION                              0x6
#define _NVMADRL_ADR6_SIZE                                  0x1
#define _NVMADRL_ADR6_LENGTH                                0x1
#define _NVMADRL_ADR6_MASK                                  0x40
#define _NVMADRL_ADR7_POSN                                  0x7
#define _NVMADRL_ADR7_POSITION                              0x7
#define _NVMADRL_ADR7_SIZE                                  0x1
#define _NVMADRL_ADR7_LENGTH                                0x1
#define _NVMADRL_ADR7_MASK                                  0x80
#define _NVMADRL_NVMADR_POSN                                0x0
#define _NVMADRL_NVMADR_POSITION                            0x0
#define _NVMADRL_NVMADR_SIZE                                0x8
#define _NVMADRL_NVMADR_LENGTH                              0x8
#define _NVMADRL_NVMADR_MASK                                0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned char           NVMDAT              __at(0x39E3);
#ifndef _LIB_BUILD
asm("NVMDAT equ 039E3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAT                    :8;
    };
    struct {
        unsigned DAT0                   :1;
        unsigned DAT1                   :1;
        unsigned DAT2                   :1;
        unsigned DAT3                   :1;
        unsigned DAT4                   :1;
        unsigned DAT5                   :1;
        unsigned DAT6                   :1;
        unsigned DAT7                   :1;
    };
    struct {
        unsigned NVMDAT                 :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
} NVMDATbits_t;
extern volatile NVMDATbits_t NVMDATbits __at(0x39E3);
// bitfield macros
#define _NVMDAT_DAT_POSN                                    0x0
#define _NVMDAT_DAT_POSITION                                0x0
#define _NVMDAT_DAT_SIZE                                    0x8
#define _NVMDAT_DAT_LENGTH                                  0x8
#define _NVMDAT_DAT_MASK                                    0xFF
#define _NVMDAT_DAT0_POSN                                   0x0
#define _NVMDAT_DAT0_POSITION                               0x0
#define _NVMDAT_DAT0_SIZE                                   0x1
#define _NVMDAT_DAT0_LENGTH                                 0x1
#define _NVMDAT_DAT0_MASK                                   0x1
#define _NVMDAT_DAT1_POSN                                   0x1
#define _NVMDAT_DAT1_POSITION                               0x1
#define _NVMDAT_DAT1_SIZE                                   0x1
#define _NVMDAT_DAT1_LENGTH                                 0x1
#define _NVMDAT_DAT1_MASK                                   0x2
#define _NVMDAT_DAT2_POSN                                   0x2
#define _NVMDAT_DAT2_POSITION                               0x2
#define _NVMDAT_DAT2_SIZE                                   0x1
#define _NVMDAT_DAT2_LENGTH                                 0x1
#define _NVMDAT_DAT2_MASK                                   0x4
#define _NVMDAT_DAT3_POSN                                   0x3
#define _NVMDAT_DAT3_POSITION                               0x3
#define _NVMDAT_DAT3_SIZE                                   0x1
#define _NVMDAT_DAT3_LENGTH                                 0x1
#define _NVMDAT_DAT3_MASK                                   0x8
#define _NVMDAT_DAT4_POSN                                   0x4
#define _NVMDAT_DAT4_POSITION                               0x4
#define _NVMDAT_DAT4_SIZE                                   0x1
#define _NVMDAT_DAT4_LENGTH                                 0x1
#define _NVMDAT_DAT4_MASK                                   0x10
#define _NVMDAT_DAT5_POSN                                   0x5
#define _NVMDAT_DAT5_POSITION                               0x5
#define _NVMDAT_DAT5_SIZE                                   0x1
#define _NVMDAT_DAT5_LENGTH                                 0x1
#define _NVMDAT_DAT5_MASK                                   0x20
#define _NVMDAT_DAT6_POSN                                   0x6
#define _NVMDAT_DAT6_POSITION                               0x6
#define _NVMDAT_DAT6_SIZE                                   0x1
#define _NVMDAT_DAT6_LENGTH                                 0x1
#define _NVMDAT_DAT6_MASK                                   0x40
#define _NVMDAT_DAT7_POSN                                   0x7
#define _NVMDAT_DAT7_POSITION                               0x7
#define _NVMDAT_DAT7_SIZE                                   0x1
#define _NVMDAT_DAT7_LENGTH                                 0x1
#define _NVMDAT_DAT7_MASK                                   0x80
#define _NVMDAT_NVMDAT_POSN                                 0x0
#define _NVMDAT_NVMDAT_POSITION                             0x0
#define _NVMDAT_NVMDAT_SIZE                                 0x8
#define _NVMDAT_NVMDAT_LENGTH                               0x8
#define _NVMDAT_NVMDAT_MASK                                 0xFF
#define _NVMDAT_NVMDAT0_POSN                                0x0
#define _NVMDAT_NVMDAT0_POSITION                            0x0
#define _NVMDAT_NVMDAT0_SIZE                                0x1
#define _NVMDAT_NVMDAT0_LENGTH                              0x1
#define _NVMDAT_NVMDAT0_MASK                                0x1
#define _NVMDAT_NVMDAT1_POSN                                0x1
#define _NVMDAT_NVMDAT1_POSITION                            0x1
#define _NVMDAT_NVMDAT1_SIZE                                0x1
#define _NVMDAT_NVMDAT1_LENGTH                              0x1
#define _NVMDAT_NVMDAT1_MASK                                0x2
#define _NVMDAT_NVMDAT2_POSN                                0x2
#define _NVMDAT_NVMDAT2_POSITION                            0x2
#define _NVMDAT_NVMDAT2_SIZE                                0x1
#define _NVMDAT_NVMDAT2_LENGTH                              0x1
#define _NVMDAT_NVMDAT2_MASK                                0x4
#define _NVMDAT_NVMDAT3_POSN                                0x3
#define _NVMDAT_NVMDAT3_POSITION                            0x3
#define _NVMDAT_NVMDAT3_SIZE                                0x1
#define _NVMDAT_NVMDAT3_LENGTH                              0x1
#define _NVMDAT_NVMDAT3_MASK                                0x8
#define _NVMDAT_NVMDAT4_POSN                                0x4
#define _NVMDAT_NVMDAT4_POSITION                            0x4
#define _NVMDAT_NVMDAT4_SIZE                                0x1
#define _NVMDAT_NVMDAT4_LENGTH                              0x1
#define _NVMDAT_NVMDAT4_MASK                                0x10
#define _NVMDAT_NVMDAT5_POSN                                0x5
#define _NVMDAT_NVMDAT5_POSITION                            0x5
#define _NVMDAT_NVMDAT5_SIZE                                0x1
#define _NVMDAT_NVMDAT5_LENGTH                              0x1
#define _NVMDAT_NVMDAT5_MASK                                0x20
#define _NVMDAT_NVMDAT6_POSN                                0x6
#define _NVMDAT_NVMDAT6_POSITION                            0x6
#define _NVMDAT_NVMDAT6_SIZE                                0x1
#define _NVMDAT_NVMDAT6_LENGTH                              0x1
#define _NVMDAT_NVMDAT6_MASK                                0x40
#define _NVMDAT_NVMDAT7_POSN                                0x7
#define _NVMDAT_NVMDAT7_POSITION                            0x7
#define _NVMDAT_NVMDAT7_SIZE                                0x1
#define _NVMDAT_NVMDAT7_LENGTH                              0x1
#define _NVMDAT_NVMDAT7_MASK                                0x80

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x39E5);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 039E5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned                        :1;
        unsigned REG                    :2;
    };
    struct {
        unsigned                        :6;
        unsigned REG0                   :1;
        unsigned REG1                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG                 :2;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG0                :1;
        unsigned NVMREG1                :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x39E5);
// bitfield macros
#define _NVMCON1_RD_POSN                                    0x0
#define _NVMCON1_RD_POSITION                                0x0
#define _NVMCON1_RD_SIZE                                    0x1
#define _NVMCON1_RD_LENGTH                                  0x1
#define _NVMCON1_RD_MASK                                    0x1
#define _NVMCON1_WR_POSN                                    0x1
#define _NVMCON1_WR_POSITION                                0x1
#define _NVMCON1_WR_SIZE                                    0x1
#define _NVMCON1_WR_LENGTH                                  0x1
#define _NVMCON1_WR_MASK                                    0x2
#define _NVMCON1_WREN_POSN                                  0x2
#define _NVMCON1_WREN_POSITION                              0x2
#define _NVMCON1_WREN_SIZE                                  0x1
#define _NVMCON1_WREN_LENGTH                                0x1
#define _NVMCON1_WREN_MASK                                  0x4
#define _NVMCON1_WRERR_POSN                                 0x3
#define _NVMCON1_WRERR_POSITION                             0x3
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x8
#define _NVMCON1_FREE_POSN                                  0x4
#define _NVMCON1_FREE_POSITION                              0x4
#define _NVMCON1_FREE_SIZE                                  0x1
#define _NVMCON1_FREE_LENGTH                                0x1
#define _NVMCON1_FREE_MASK                                  0x10
#define _NVMCON1_REG_POSN                                   0x6
#define _NVMCON1_REG_POSITION                               0x6
#define _NVMCON1_REG_SIZE                                   0x2
#define _NVMCON1_REG_LENGTH                                 0x2
#define _NVMCON1_REG_MASK                                   0xC0
#define _NVMCON1_REG0_POSN                                  0x6
#define _NVMCON1_REG0_POSITION                              0x6
#define _NVMCON1_REG0_SIZE                                  0x1
#define _NVMCON1_REG0_LENGTH                                0x1
#define _NVMCON1_REG0_MASK                                  0x40
#define _NVMCON1_REG1_POSN                                  0x7
#define _NVMCON1_REG1_POSITION                              0x7
#define _NVMCON1_REG1_SIZE                                  0x1
#define _NVMCON1_REG1_LENGTH                                0x1
#define _NVMCON1_REG1_MASK                                  0x80
#define _NVMCON1_NVMREG_POSN                                0x6
#define _NVMCON1_NVMREG_POSITION                            0x6
#define _NVMCON1_NVMREG_SIZE                                0x2
#define _NVMCON1_NVMREG_LENGTH                              0x2
#define _NVMCON1_NVMREG_MASK                                0xC0
#define _NVMCON1_NVMREG0_POSN                               0x6
#define _NVMCON1_NVMREG0_POSITION                           0x6
#define _NVMCON1_NVMREG0_SIZE                               0x1
#define _NVMCON1_NVMREG0_LENGTH                             0x1
#define _NVMCON1_NVMREG0_MASK                               0x40
#define _NVMCON1_NVMREG1_POSN                               0x7
#define _NVMCON1_NVMREG1_POSITION                           0x7
#define _NVMCON1_NVMREG1_SIZE                               0x1
#define _NVMCON1_NVMREG1_LENGTH                             0x1
#define _NVMCON1_NVMREG1_MASK                               0x80

// Register: NVMCON2
#define NVMCON2 NVMCON2
extern volatile unsigned char           NVMCON2             __at(0x39E6);
#ifndef _LIB_BUILD
asm("NVMCON2 equ 039E6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMCON2                :8;
    };
} NVMCON2bits_t;
